// 랜덤 한글 글자 10개로 문자열을 만들어라
// 단 '가'부터 '힣'까지의 글자 중에서 랜덤하게 나와야 한다.

/**//////////////////////////////**/
/**/let ga = "가".charCodeAt(0);/**/
/**/let hi = "힣".charCodeAt(0);/**/
/**//////////////////////////////**/

let getRandomChar = () => {
    const code = Math.floor(Math.random() * (hi - ga)) + ga;
    return String.fromCharCode(code);
};

/**////////////////////////////////////////////////////////**/
/**/let total = "";////////////////////////////////////////**/
/**/for (let i = 0; i < 10; i++) total += getRandomChar();/**/
/**/console.log(total);////////////////////////////////////**/
/**////////////////////////////////////////////////////////**/