// CMYK는 색을 표현하는 방법 중 하나입니다.
// C, M, Y, K라는 요소로 값을 표현하는 것입니다.
// 하지만 이 경우 R, G, B의 값으로 (Red, Green, Blue) 변환해야 색을 이해할 수 있는 경우가 있습니다.
// 변환 식은 다음과 같습니다.
// R = 255 × (1-C) × (1-K)
// G = 255 × (1-M) × (1-K)
// B = 255 × (1-Y) × (1-K)
// 이 때, C, M, Y, K 라는 값을 받으면 rgb(r, g, b)의 형태로 리턴하는 함수를 만드세요.
// 단, 무조건 정수가 나와야합니다.
// 정수는 "반올림"합니다.

/**
 * 
 * @param {number} C 
 * @param {number} M 
 * @param {number} Y 
 * @param {number} K 
 */
let CMYKtoRGB = (C, M, Y, K) => {
    R = Math.floor(Math.round(255 * (1 - C) * (1 - K)));
    G = Math.floor(Math.round(255 * (1 - M) * (1 - K)));
    B = Math.floor(Math.round(255 * (1 - Y) * (1 - K)));
    return (`rgb(${R},${G},${B})`);
};


/**///////////////////////////////////////////////////////////////////////////////////////////////////////////**/
/**/console.log(`"DarkSalmon"색의 CMYK 값은 (0,0.36,0.48,0.09)이며 RGB 값은 ${CMYKtoRGB(0,0.36,0.48,0.09)}`);/**/
/**/console.log(`"Lavender"색의 CMYK 값은 (0.08,0.08,0,0.02)이며 RGB 값은 ${CMYKtoRGB(0.08,0.08,0,0.02)}`);///**/
/**/console.log(`"Magenta"색의 CMYK 값은 (0,1,0,0)이며 RGB 값은 ${CMYKtoRGB(0,1,0,0)}`);//////////////////////**/
/**/console.log(`"Olive"색의 CMYK 값은 (0,0,1,0.5)이며 RGB 값은 ${CMYKtoRGB(0,0,1,0.5)}`);////////////////////**/
/**/console.log(`"YellowGreen"색의 CMYK 값은 (0.25,0,0.76,0.2)이며 RGB 값은 ${CMYKtoRGB(0.25,0,0.76,0.2)}`);//**/
/**/console.log(`"Coral"색의 CMYK 값은 (0,0.5,0.69,0)이며 RGB 값은 ${CMYKtoRGB(0,0.5,0.69,0)}`);//////////////**/
/**/console.log(`"DarkOrchid"색의 CMYK 값은 (0.25,0.75,0,0.12)이며 RGB 값은 ${CMYKtoRGB(0.25,0.75,0,0.12)}`);/**/
/**/console.log(`"Gray"색의 CMYK 값은 (0,0,0,0.5)이며 RGB 값은 ${CMYKtoRGB(0,0,0,0.5)}`);/////////////////////**/
/**///////////////////////////////////////////////////////////////////////////////////////////////////////////**/