// getRand(a, b)를 했을 경우 최소 a, 최대 b 사이의 정수가 랜덤하게 나오도록 getRand 함수의 리턴을 만들어보세요.
// 코드를 0 부분에만 작성해주세요.
const getRand = (a, b) => {
    return Math.floor(Math.random()*(b - a + 1)+ a);
}

/**/////////////////////////////////////////////////**/
/**/console.log(`범위 0 ~ 1 : ${getRand(0, 1)}`);///**/
/**/console.log(`범위 5 ~ 10 : ${getRand(5, 10)}`);/**/
/**/console.log(`범위 -1 ~ 1 : ${getRand(-1, 1)}`);/**/
/**/console.log(`범위 100 : ${getRand(100, 100)}`);/**/
/**/////////////////////////////////////////////////**/